In [39]:
def addition (a,b,c):
    a=10
    b=20
    c=30
    d=a+b+c
    return (d)

In [40]:
addition (10,20,30)

60

In [59]:
def addition ():
    a=10
    b=20
    c=a+b
    return (c)

In [60]:
addition ()

30

In [62]:
def multiplication ():
    a=10
    b=20
    c=a*b
    return(c)

In [63]:
multiplication ()

200

In [64]:
def substraction (a,b):
    
    c=a-b
    return(c)

In [66]:
substraction (300,175)

125

In [ ]:
def division ():

In [1]:
def ipl_zomato(predictscore,score):
    if score<150:
        retun=predictscore*.10
    elif score>=150 and score<=200:
        retun=predictscore*.20
    elif score>200:
        retun=predictscore*.50
    else:
        retun=notavailable
    return retun

In [4]:
ipl_zomato(150,170)

30.0

In [3]:
230*20/100

46.0

In [4]:
230*50/100

115.0

In [18]:
import pandas as pd

In [21]:
df=pd.read_csv(r"D:\learn.txt",sep=",")

In [22]:
df

Empty DataFrame
Columns: [name, gender]
Index: []

In [23]:
import pandas as pd

In [24]:
df=pd.read_csv(r"E:\New Text Document.txt",sep=",",header="infer")

In [25]:
df

     name class
0   durga   Bsc
1    vani   Bsc
2   ayesh   Bsc
3  anusha   Bsc

In [26]:
import pandas as pd

In [14]:
df=pd.read_excel(r"E:\durga79\git\nagadurga\class_details.xlsx")

In [27]:
df.iloc[0:2,0:3]

   s no        name class
0     1  naga durga  10th
1     2      anitha  11th

In [18]:
df

SyntaxError: invalid syntax (952654395.py, line 1)

In [37]:
import pandas as pd

In [23]:
df=pd.read_excel(r"E:\durga79\class_details2.xlsx",sheet_name="Sheet2")

In [40]:
df

   s no        name class  roll number
0     1  naga durga  10th           26
1     2      anitha  11th           27
2     3        raji  12th           28
3     4   divya sri  13th           29
4     5       sneha  14th           30

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv(r"E:\New Text Document (2).txt",sep="*",header="infer")

In [4]:
df

     name class
0   durga   bsc
1    vani   bsc
2  ayesha   bsc

In [5]:
import pandas as pd

In [6]:
df=pd.read_excel(r"E:\durga79\degree_frnd.xlsx",sheet_name="Sheet1")

In [8]:
df.head()

   s.no    name class  roll number
0     1  ayesha   bsc          205
1     2   durga   bsc          226
2     3    vani   bsc          244
3     4  anitha   bsc          240
4     5   divya   bsc          234

In [10]:
df.tail()

   s.no     name class  roll number
5     6   akhila   bsc          204
6     7  supraja   bsc          242
7     8   anusha   bsc          241
8     9  lavanya   bsc          216
9    10    syamu   bsc          239

In [12]:
df.shape

(10, 4)

In [13]:
df.shape[0]

10

In [14]:
df.shape[1]

4

In [2]:
import pandas as pd

In [10]:
df=pd.read_csv(r"E:\durga79\name,qualification.txt",header="infer")

In [11]:
df

     name qualification
0  anitha         inter
1   durga           bsc
2   sneha           bsc
3   divya           bsc

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv(r"E:\durga79\name,qualification.txt",header="infer")

In [5]:
df

  name*qualification
0       anitha*inter
1          durga*bsc
2          sneha*bsc
3          divya*bsc

In [7]:
import pandas as pd

In [9]:
df=pd.read_excel(r"E:\durga79\Book1.xlsx",sheet_name="Sheet1")

In [10]:
df

     name qualification
0  anitha         inter
1   durga           bsc
2   divya           bsc
3   sneha           bsc

In [4]:
import pandas as pd

In [3]:
df=pd.read_excel(r"E:\durga79\friendsnamesq.xlsx",sheet_name="Sheet1")

In [4]:
df

  friend_names       quality
0         vani  always_smile
1       ayesha  always_smile
2       anusha      senstive
3       anitha      talktive
4        divya      talktive
5       akhila   intelligent
6      supraja      talktive
7        manoj  comedy_peace
8      harshad      talktive
9         ajay  always_smile

In [6]:
df=pd.read_excel(r"E:\durga79\friendsnamesq.xlsx",sheet_name="Sheet4")

In [7]:
df

     nonveg_fooditems            taste
0             biryani  spicy_and_tasty
1   chicken_friedrice  spicy_and_tasty
2              omblet  spicy_and_tasty
3     chicken_lolipop            spicy
4  chicken_manchuriya            spicy
5             fishfry            spicy
6          prawns_fry            spicy
7     grilled_chicken            spicy
8          crab_curry  spicy_and_salty
9        mutton_curry            spicy

In [5]:
df.head()

     nonveg_fooditems            taste
0             biryani  spicy_and_tasty
1   chicken_friedrice  spicy_and_tasty
2              omblet  spicy_and_tasty
3     chicken_lolipop            spicy
4  chicken_manchuriya            spicy

In [6]:
df.tail()

  nonveg_fooditems            taste
5          fishfry            spicy
6       prawns_fry            spicy
7  grilled_chicken            spicy
8       crab_curry  spicy_and_salty
9     mutton_curry            spicy

In [7]:
df.shape

(10, 2)

In [8]:
df.shape[1]

2

In [6]:
df.dtypes

friend_names    object
quality         object
dtype: object

In [11]:
df.columns

Index(['friend_names', 'quality'], dtype='object')

In [12]:
lst=list(df.columns)

In [13]:
lst

['friend_names', 'quality']

In [19]:
for p in lst:
    print(p)

friend_names
quality

In [14]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   friend_names  10 non-null     object
 1   quality       10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [9]:
df[0:5]

     nonveg_fooditems            taste
0             biryani  spicy_and_tasty
1   chicken_friedrice  spicy_and_tasty
2              omblet  spicy_and_tasty
3     chicken_lolipop            spicy
4  chicken_manchuriya            spicy

In [13]:
df.iloc[0:5,0:]

     nonveg_fooditems            taste
0             biryani  spicy_and_tasty
1   chicken_friedrice  spicy_and_tasty
2              omblet  spicy_and_tasty
3     chicken_lolipop            spicy
4  chicken_manchuriya            spicy